# RemoveIntersectionElement Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..RemoveIntersectionElement Method
DividedSurface Class See Also
---
Removes an intersection element from a divided surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public void RemoveIntersectionElement(
	ElementId referenceElemIdToRemove
)
```

Visual Basic
---
```text
Public Sub RemoveIntersectionElement ( _
	referenceElemIdToRemove As ElementId _
)
```

Visual C++
---
```text
public:
void RemoveIntersectionElement(
	ElementId^ referenceElemIdToRemove
)
```

# ### Parameters
referenceElemIdToRemove
    Type: Autodesk.Revit.DB..::..ElementId The intersection element to be removed.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace